{
    "rice___Rice_Blast": "Incorporate or roll the rice stubble soon after harvest to promote early decomposition Plant the least-susceptible varieties and use a broad-spectrum seed treatment Seed over a range of time to spread the heading dates However avoid planting late because blast will be more severe Avoid excessive nitrogen application rates and apply no more than 30 pounds per acre of nitrogen per application at midseason. In fields with a history of blast, always split applications",
    "rice___Rice_Blight": "Split doses - Avoid using high doses of nitrogenous fertilizers. Go for judicious application. Apply nitrogen fertilizer in three split doses, 50 per cent basal, 25 per cent in tillering phase and 25 per cent nitrogen in panicle initiation stage.Use fresh cow dung slurry at 2kg/10 litres of water, strain it in fine cloth and spray at an interval of 7-10 days 3-4 times at 500 litres/ha. Keep fields clean — remove weed hosts and plough well. Chemical control - Soak the seeds with a solution of plantomycin 10gms or streptocyclin 1.5gms and copper oxychloride 25gms in 10 litres of water. Spray the affected crop with the same chemicals at 500 litres /ha at 7-10 days intervals 2-3 times on need basis",
    "rice___Rice_Tungro": "Use varieties with some degree of resistance to the vector.Plant two crops in the months when the vector population is low. Practice crop rotation with non-host crops Schedule the planting to ensure nearly synchronous growth in each area. Destroy the eggs and breeding sites through plowing. Adopt alternate wetting and drying the field. Conserve beneficial insects.",
    "Sugarcane___Bacterial": "Grow resistant varieties.Collect healthy planting material from the seed nursery Implement wide crop rotation with green manure crops Improve your drainage system to reduce the incidence of the Fertilize moderately with nitrogen.",
    "Sugarcane___Red_Rot": "Plant resistant varieties, if suitable for your area. Use healthy seeds and seedlings from a certified source.Obtain planting material from fields with no disease.Change sowing time to avoid either too hot or too cool temperatures Regularly monitor the field and rogue diseased plants or clumps.Avoid the ratooning of diseased crops.Avoid the ratooning of diseased crops.Remove any plant debris from the field after harvest and burn them.Alternatively, plow the field several times to expose fungal material in the soil to sunlight.Plan a good crop rotation with non-susceptible plants for a 2-3 years.",
    "Wheat___Yellow_rust": "Use only registered, good quality seeds from genuine source. Select resistant and region-specific varieties for sowing. Grow stable and resistant varieties if available. Sow winter wheat later and summer wheat sooner than usually. Screen fields for volunteer plants and remove them. Ensure low crop density at planting. Plan and implement a healthy crop rotation. Ensure adequate fertilization of nitrogen. Remove and destroy crop debris after harvest.",
    "Wheat___Brown_rust": "Grow stable and resistant varieties if available.Sow winter wheat later and summer wheat sooner than usually.Screen fields for volunteer plants and remove them. Ensure low crop density at planting. Plan and implement a healthy crop rotation. Ensure adequate fertilization of nitrogen. Remove and destroy crop debris after harvest."
}